import {NavItem} from "vuepress/config";

export default [
    {
        text: "学习路线",
        link: '/学习路线/'
    },
    {
        text: "自学之路",
        link: "/自学之路/",
        items: [
            {
                text: "大学经历", link: "/自学之路/#大学经历",
            },
            {
                text: "求职经历", link: "/自学之路/#求职经历",
            },
            {
                text: "职场工作", link: "/自学之路/#职场工作",
            },
            {
                text: "创作经历", link: "/自学之路/#创作经历",
            },
            {
                text: "创业经历", link: "/自学之路/#创业经历",
            },
            {
                text: "生活日常", link: "/自学之路/#生活日常",
            },

        ]
    },
    {
        text: "编程分享",
        link: '/编程分享/',
        items: [
            {
                text: "入门必看-学习路线", link: "/编程分享/#入门必看-学习路线",
            },
            {
                text: "学习指南", link: "/编程分享/#学习指南",
            },
            {
                text: "开发经验", link: "/编程分享/#开发经验",
            },
            {
                text: "求职经验", link: "/编程分享/#求职经验",
            },
            {
                text: "职场经验", link: "/编程分享/#职场经验",
            },
            {
                text: "技术分享", link: "/编程分享/#技术分享",
            },
            {
                text: "实战教程", link: "/编程分享/#实战教程",
            },
            {
                text: "其他", link: "/编程分享/#其他",
            },
            {
                text: "项目教程", link: "/编程分享/#📚-项目教程",
            },
            {
                text: "个人作品", link: "/编程分享/#个人作品",
            },

            {
                text: "编程资源", link: "/编程分享/#🎁-编程资源",
            },

            {
                text: "科技科普", link: "/编程分享/#🌐-科技科普",
            },




        ]
    },
    {
        text: "项目实战",
        link: '/项目实战/',
        items: [
            {
                text: "OJ 判题系统", link: "/项目实战/OJ 判题系统.md",
            },
            {
                text: "智能 BI 平台", link: "/项目实战/智能 BI 平台.md",
            },
            {
                text: "聚合搜索平台", link: "/项目实战/聚合搜索平台.md",
            },
            {
                text: "API 开放平台", link: "/项目实战/API 开放平台.md",
            },
            {
                text: "伙伴匹配系统", link: "/项目实战/伙伴匹配系统.md",
            },
            {
                text: "用户中心项目", link: "/项目实战/用户中心项目.md",
            },
            {
                text: "Java 后端万用项目模板", link: "/项目实战/Java 后端万用项目模板.md",
            },
        ]
    },
    {
        text: "知识碎片",
        link: '/知识碎片/'
    },
    {
        text: "🔥 编程导航",
        link: '/编程导航/'
    },
    {
        text: "产品服务",
        link: '/产品服务/'
    },
    {
        text: "编程词典",
        link: "/编程词典/",
        items: [
            { text: "Java", link: "/Java/" },
            { text: "Python", link: "/Python/" },
            { text: "前端", link: "/前端/" },
            { text: "Go", link: "/Go/" },
            { text: "C++", link: "/Cpp/" },
            { text: "游戏开发", link: "/游戏开发/" },
            { text: "人工智能", link: "/人工智能/" },
            { text: "大数据", link: "/大数据/" },
            { text: "云计算", link: "/云计算/" },
            { text: "区块链", link: "/区块链/" },
            { text: "机器学习", link: "/机器学习/" },
            { text: "深度学习", link: "/深度学习/" },
            { text: "自然语言处理", link: "/自然语言处理/" },
            { text: "数据挖掘", link: "/数据挖掘/" },
            { text: "数据可视化", link: "/数据可视化/" },
            { text: "图像处理", link: "/图像处理/" },
            { text: "网络安全", link: "/网络安全/" },
            { text: "数据结构与算法", link: "/数据结构与算法/" },
            { text: "操作系统", link: "/操作系统/" },
            { text: "数据库", link: "/数据库/" },
            { text: "物联网", link: "/物联网/" },
            { text: "嵌入式系统", link: "/嵌入式系统/" },
            { text: "软件工程", link: "/软件工程/" },
            { text: "机器人技术", link: "/机器人技术/" },
            { text: "计算机网络", link: "/计算机网络/" },
            { text: "移动开发", link: "/移动开发/" },
            { text: "测试", link: "/测试/" },
            { text: "人机交互", link: "/人机交互/" },
            { text: "编译原理", link: "/编译原理/" },
            { text: "计算机图形学", link: "/计算机图形学/" },
        ]
    },
    {
        text: "作者",
        link: '/作者/'
    },
] as NavItem[];
