import {NavItem} from "vuepress/config";

export default [
    {
        text: "学习路线",
        link: '/学习路线/'
    },
    {
        text: "自学之路",
        link: "/自学之路/",
        items: [
            {
                text: "大学经历", link: "/自学之路/#大学经历",
            },
            {
                text: "求职经历", link: "/自学之路/#求职经历",
            },
            {
                text: "职场工作", link: "/自学之路/#职场工作",
            },
            {
                text: "创作经历", link: "/自学之路/#创作经历",
            },
            {
                text: "创业经历", link: "/自学之路/#创业经历",
            },
            {
                text: "生活日常", link: "/自学之路/#生活日常",
            },

        ]
    },
    {
        text: "编程分享",
        link: '/编程分享/',
        items: [
            {
                text: "入门必看-学习路线", link: "/编程分享/#入门必看-学习路线",
            },
            {
                text: "学习指南", link: "/编程分享/#学习指南",
            },
            {
                text: "开发经验", link: "/编程分享/#开发经验",
            },
            {
                text: "求职经验", link: "/编程分享/#求职经验",
            },
            {
                text: "职场经验", link: "/编程分享/#职场经验",
            },
            {
                text: "技术分享", link: "/编程分享/#技术分享",
            },
            {
                text: "实战教程", link: "/编程分享/#实战教程",
            },
            {
                text: "其他", link: "/编程分享/#其他",
            },
            {
                text: "项目教程", link: "/编程分享/#📚-项目教程",
            },
            {
                text: "个人作品", link: "/编程分享/#个人作品",
            },

            {
                text: "编程资源", link: "/编程分享/#🎁-编程资源",
            },

            {
                text: "科技科普", link: "/编程分享/#🌐-科技科普",
            },


        ]
    },
    {
        text: "项目实战",
        link: '/项目实战/',
        items: [
            {
                text: "代码生成器共享平台", link: "/项目实战/#代码生成器共享平台"
            },
            {
                text: "手写 RPC 框架", link: "/项目实战/#手写 RPC 框架",
            },
            {
                text: "OJ 判题系统", link: "/项目实战/#OJ 判题系统",
            },
            {
                text: "智能 BI 平台", link: "/项目实战/#智能 BI 平台",
            },
            {
                text: "聚合搜索平台", link: "/项目实战/#聚合搜索平台",
            },
            {
                text: "API 开放平台", link: "/项目实战/#API 开放平台",
            },
            {
                text: "伙伴匹配系统", link: "/项目实战/#伙伴匹配系统",
            },
            {
                text: "用户中心项目", link: "/项目实战/#用户中心项目",
            },
            {
                text: "Java 后端万用项目模板", link: "/项目实战/#Java 后端万用项目模板",
            },
            {
                text: "前端万用项目模板",link: "/项目实战/#前端万用项目模板"
            },
            {
                text: "鱼皮项目学习建议",link: "/项目实战/#鱼皮项目学习建议（必读）"
            }
        ]
    },
    {
        text: "知识碎片",
        link: '/知识碎片/'
    },
    {
        text:"Bug 修复手册",
        link: '/Bug 修复手册/',
        items:[
            {text:"经典 Bug 解决方案",link:"/Bug 修复手册/#经典 Bug 解决方案"},
            {text:"解决 Bug 的流程套路",link:"/Bug 修复手册/#解决 Bug 的流程套路"},
        ]
    },
    {
        text: "🔥 编程导航",
        link: '/编程导航/'
    },
    {
        text: "产品服务",
        link: '/产品服务/'
    },

    {
        text: "作者",
        link: '/作者/'
    },
] as NavItem[];
