export default [
    "",

    {
        title: "第零关",
        collapsable: true,
        children: [
            "第零关 通关热身/",
            "第零关 通关热身/1.算法就是程序员的驾照.md",
            "第零关 通关热身/2.怎么准备算法和应对算法.md",
            "第零关 通关热身/3.关于算法需要的编程语言能力.md",
            "第零关 通关热身/4.时间复杂度和空间复杂度问题.md",
            "第零关 通关热身/5.一图看懂算法的体系.md",
            "第零关 通关热身/6.往期优秀学员打卡案例.md",
        ],
    },
    {
        title: "第一关",
        collapsable: true,
        children: [
            "第一关 原来链表这么有用/",
            "第一关 原来链表这么有用/1.青铜挑战—小白也能学会的链表（C语言）.md",
            "第一关 原来链表这么有用/1.青铜挑战—小白也能学会的链表（Javapython）.md",
            "第一关 原来链表这么有用/2.白银挑战——链表高频面试算法题.md",
            "第一关 原来链表这么有用/3.黄金挑战——继续挑战链表的问题.md",
        ],
    },
    {
        title: "第二关",
        collapsable: true,
        children: [
            "第二关 两天写了三次的链表反转/",
            "第二关 两天写了三次的链表反转/1.青铜挑战——手写链表反转.md",
            "第二关 两天写了三次的链表反转/2.白银挑战——链表反转的拓展问题.md",
            "第二关 两天写了三次的链表反转/3.黄金挑战——继续讨论数组问题.md",
        ],
    },
    {
        title: "第三关",
        collapsable: true,
        children: [
            "第三关 爱不起的数组与双指针思想/",
            "第三关 爱不起的数组与双指针思想/1.青铜挑战——爱不起的数组.md",
            "第三关 爱不起的数组与双指针思想/2.白银挑战——双指针思想以及应用.md",
            "第三关 爱不起的数组与双指针思想/3.黄金挑战——链表里最难的题.md",
        ],
    },
    {
        title: "第四关",
        collapsable: true,
        children: [
            "第四关 站不住的栈/",
            "第四关 站不住的栈/1.青铜挑战——理解栈手写栈.md",
            "第四关 站不住的栈/2.白银挑战——栈的经典算法问题.md",
            "第四关 站不住的栈/3.黄金挑战——表达式问题.md",
        ],
    },
    {
        title: "第五关",
        collapsable: true,
        children: [
            "第五关 算法的备胎hash和找靠山的队列/",
            "第五关 算法的备胎hash和找靠山的队列/1.青铜挑战——队列和Hash的特征.md",
            "第五关 算法的备胎hash和找靠山的队列/2.白银挑战——队栈和Hash的经典算法题.md",
            "第五关 算法的备胎hash和找靠山的队列/3.黄金挑战——LRU的设计与实现.md",
        ],
    },
    {
        title: "第六关",
        collapsable: true,
        children: [
            "第六关 其实很简单的树与层次遍历问题/",
            "第六关 其实很简单的树与层次遍历问题/1.青铜挑战——理解树的结构.md",
            "第六关 其实很简单的树与层次遍历问题/2.白银挑战——二叉树的层次遍历经典问题.md",
            "第六关 其实很简单的树与层次遍历问题/3.黄金挑战——BFS问题.md",
        ],
    },
    {
        title: "第七关",
        collapsable: true,
        children: [
            "第七关 算法真正开始了—递归与二叉树遍历/",
            "第七关 算法真正开始了—递归与二叉树遍历/1.青铜挑战——一图理解递归.md",
            "第七关 算法真正开始了—递归与二叉树遍历/2.白银挑战——理解二叉树的遍历.md",
            "第七关 算法真正开始了—递归与二叉树遍历/3.黄金挑战——迭代实现二叉树的遍历.md",
        ],
    },
    {
        title: "第八关",
        collapsable: true,
        children: [
            "第八关 二叉树的深度优先经典问题/",
            "第八关 二叉树的深度优先经典问题/1.青铜挑战——二叉树的经典算法题.md",
            "第八关 二叉树的深度优先经典问题/2.白银挑战——二叉树的深度和高度问题.md",
            "第八关 二叉树的深度优先经典问题/3.黄金挑战——寻找祖先问题.md",
        ],
    },
    {
        title: "第九关",
        collapsable: true,
        children: [
            "第九关 心有灵犀的二分查找与二叉树的中序遍历/",
            "第九关 心有灵犀的二分查找与二叉树的中序遍历/1.青铜挑战——逢试必考的二分查找.md",
            "第九关 心有灵犀的二分查找与二叉树的中序遍历/2.白银挑战——二分查找与搜索树高频问题.md",
            "第九关 心有灵犀的二分查找与二叉树的中序遍历/3.黄金挑战——几道有挑战的问题.md",
        ],
    },
    {
        title: "第十关",
        collapsable: true,
        children: [
            "第十关 天上的明月—快速排序与归并排序/",
            "第十关 天上的明月—快速排序与归并排序/1.青铜挑战——快速排序并不难.md",
            "第十关 天上的明月—快速排序与归并排序/2.白银挑战——数组中第K大的数字.md",
            "第十关 天上的明月—快速排序与归并排序/3.黄金挑战——归并排序.md",
        ],
    },
    {
        title: "第十一关",
        collapsable: true,
        children: [
            "第十一关 刷题模板之位运算/",
            "第十一关 刷题模板之位运算/1.青铜挑战——理解位运算的规则.md",
            "第十一关 刷题模板之位运算/2.白银挑战——位运算的高频算法题.md",
            "第十一关 刷题模板之位运算/3. 黄金挑战—位运算如何实现压缩存储.md",
        ],
    },
    {
        title: "第十二关",
        collapsable: true,
        children: [
            "第十二关 刷题模板之字符串/",
            "第十二关 刷题模板之字符串/1.青铜挑战——字符串：隐形的王者.md",
            "第十二关 刷题模板之字符串/2.白银挑战——字符串经典基础面试题.md",
            "第十二关 刷题模板之字符串/3.黄金挑战——字符串冲刺题.md",
        ],
    },
    {
        title: "第十三关",
        collapsable: true,
        children: [
            "第十三关 刷题模板之数字与数学/",
            "第十三关 刷题模板之数字与数学/1.青铜挑战——数字与数学基础问题.md",
            "第十三关 刷题模板之数字与数学/2.白银挑战——数字与数学高频问题.md",
            "第十三关 刷题模板之数字与数学/3.黄金挑战—数论问题.md",
        ],
    },
    {
        title: "第十四关",
        collapsable: true,
        children: [
            "第十四关 刷题模板之 堆结构/",
            "第十四关 刷题模板之 堆结构/1.青铜挑战——堆结构.md",
            "第十四关 刷题模板之 堆结构/2.白银挑战——堆能高效解决的经典问题.md",
            "第十四关 刷题模板之 堆结构/3.黄金挑战——数据流的中位数.md",
        ],
    },
    {
        title: "第十五关",
        collapsable: true,
        children: [
            "第十五关 超大规模数据场景常见问题/",
            "第十五关 超大规模数据场景常见问题/1.青铜挑战——用4KB内存寻找重复元素.md",
            "第十五关 超大规模数据场景常见问题/2.白银挑战——海量数据场景下的热门算法题.md",
            "第十五关 超大规模数据场景常见问题/3.黄金挑战：继续研究超大规模数据场景的问题.md",
        ],
    },
    {
        title: "第十六关",
        collapsable: true,
        children: [
            "第十六关 经典刷题思想之滑动窗口/",
            "第十六关 经典刷题思想之滑动窗口/1.青铜挑战—滑动窗口其实很简单.md",
            "第十六关 经典刷题思想之滑动窗口/2.白银挑战—滑动窗口经典问题.md",
            "第十六关 经典刷题思想之滑动窗口/3.黄金挑战—滑动窗口与堆结合.md",
        ],
    },
    {
        title: "第十七关",
        collapsable: true,
        children: [
            "第十七关 经典刷题思想之贪心/",
            "第十七关 经典刷题思想之贪心/1.青铜挑战—贪心其实很简单.md",
            "第十七关 经典刷题思想之贪心/2.白银挑战—贪心高频问题.md",
            "第十七关 经典刷题思想之贪心/3.黄金挑战—跳跃游戏问题.md",
        ],
    },
    {
        title: "第十八关",
        collapsable: true,
        children: [
            "第十八关 经典刷题思想之回溯/",
            "第十八关 经典刷题思想之回溯/1.青铜挑战—回溯是怎么回事.md",
            "第十八关 经典刷题思想之回溯/2.白银挑战—回溯热门问题.md",
            "第十八关 经典刷题思想之回溯/3.黄金挑战—继续看回溯问题.md",
        ],
    },

    {
        title: "第十九关",
        collapsable: true,
        children: [
            "第十九关 经典刷题思想之动态规划/",
            "第十九关 经典刷题思想之动态规划/1.青铜挑战—动态规划是怎么回事.md",
            "第十九关 经典刷题思想之动态规划/2.白银挑战—动态规划高频问题.md",
            "第十九关 经典刷题思想之动态规划/3.黄金挑战—继续盘点高频DP问题.md",
        ],
    },
    {
        title: "第二十关",
        collapsable: true,
        children: [
            "第二十关 图算法——中看不中用/",
            "第二十关 图算法——中看不中用/1. 青铜挑战—认识图结构.md",
            "第二十关 图算法——中看不中用/2. 白银挑战—图的存储与遍历.md",
            "第二十关 图算法——中看不中用/3. 黄金挑战—常见的图算法介绍.md",
        ],
    },

];
