export default [
    "",
    {
        title: "经典 Bug 解决方案",
        collapsable: true,
        children: [
            "经典 Bug 解决方案/Bug 解决  前端无法正确请求后端接口并得到响应？",
            "经典 Bug 解决方案/Bug 解决  前端框架初始化错误",
            "经典 Bug 解决方案/Bug 解决  前端项目无法正确安装依赖？",
            "经典 Bug 解决方案/Bug 解决  前端项目能运行，但有很多错误提示和告警？",
            "经典 Bug 解决方案/Bug 解决  后端项目无法正常启动，或依赖服务连接失败",
            "经典 Bug 解决方案/Bug 解决  数据查询为空或错误",
            "经典 Bug 解决方案/Bug 解决  无法正常登录或获取不到用户信息",
            "经典 Bug 解决方案/Bug 解决  无法访问线上服务",
            "经典 Bug 解决方案/Bug 解决  本地项目上线后出现错误",
            "经典 Bug 解决方案/Bug 解决  项目启动失败",
            "经典 Bug 解决方案/Bug 解决｜无法正确访问到页面或出现 404 错误",
            "经典 Bug 解决方案/Bug 解决｜组件库报错、或样式丢失不生效",
        ],
    },
    {
        title: "解决 Bug 的流程套路",
        collapsable: true,
        children: [
            "解决 Bug 的流程套路/常见写 Bug 原因汇总",
            "解决 Bug 的流程套路/常见请求错误码解释及解决方案",
            "解决 Bug 的流程套路/解决 Bug 的流程套路总结",
        ],
    },
];
