export default [
  "",
  {
    title: "学习路线",
    collapsable: false,
    children: [
      "2025年最新Java学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新前端学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新C++学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新Python学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新数据结构和算法学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新SQL免费实战自学网站零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新计算机基础学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新Git&GitHub学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新设计模式学习路线零基础到精通一条龙（万人收藏⭐️）.md",
      "2025年最新Linux学习路线零基础到精通一条龙（万人收藏⭐️）.md",
    ],
  },
];
